{
    "christoph-stanger": {
        "name": "Christoph Stanger",
        "photo": "christoph-stanger.jpg",
        "title": "How to develop event-driven applications. Locally.",
        "description": "This talk will present a modern approach to serverless, event-driven Google Cloud architectures that reveals how Google's commitment to open source and open standards improves developers' daily work and productivity. A demo will showcase how the open cloud approach allows for fast serverless development cycles through local development capabilities.<br/><br/>Take away #1: Developing and debugging event-driven architectures truly locally (EventArc, Cloud Run, Cloud Functions) even with external dependencies, is a valuable takeaway.<br/><br/>Take away #2: Fast and convenient debugging cycles are the key for effective and fun software development - how this is possible with cloud native (event driven/Serverless architectures) architectures is a takeaway of this talk.<br/><br/>Take away #3: You will also learn what benefits our open cloud approach (open sourcing and implementing open standards) has, on very concrete examples.",
        "about": "I'm a Strategic Cloud Engineer at Google, focused on containerized application modernization and serverless application development. NodeJS and Typescript are my preferred tools to go fast.<br/>Before Google, I worked at AWS and MaibornWolff building apps and services on various web, mobile and cloud platforms. Originally from Austria, I enjoy being close to the ‘cloud’ during mountaineering as well."
    },
    "matthew-wilson": {
        "name": "Matthew Wilson",
        "photo": "matthew-wilson.png",
        "title": "Zero to Serverless car insurance",
        "description": "Over the past 2 years we learnt a lot about what it takes to build a serverless platform: what it means to be serverless-first, what works well, what doesn’t, but above all we learnt to love the serverless offering on AWS. This talk describes our Serverless education, warts and all, in the hope that you can learn from it.<br/><br/>We will discuss topics like why you shouldn’t try to stuff a Monolith into a Lambda, how you can avoid Lambda functions entirely, when to make use of Step Functions and what valuable advice you can take from the Well-Architected Framework. The talk is for anyone considering, or partially along, their transition to Serverless.<br/><br/>This talk is split into the four key phases of our project<br/><br/>Phase 1 - The GraphQL Lambdalith In this section I discuss how our project was first structured, a lambdalith running Apollo Server. We then break this architecture down to use AppSync instead with multiple lambda resolvers. Then we discuss the pros and cons of this approach.<br/><br/>Phase 2 - Going Lambda-less In this section we discuss the next major step for our project, replacing some of our direct lambda resolvers with DynamoDB resolvers instead. I dive into cold starts and how direct service integrations eliminate the need to worry about them.<br/><br/>Phase 3 - Thinking in events Not all event driven applications are serverless, but all serverless applications are event driven. Is this true? In this section I discuss how I noticed that our team started to think in an event driven way without ever being instructed to do so.<br/><br/>Phase 4 - Step Functions How do we use step functions in production? How do you test step functions? How do you deploy step functions? All questions we have asked and now have answers to. But there are some gotchas that could catch teams out, mainly where do you keep your business logic so that your state machines will be easy to \"reason about\".",
        "about": "Full stack developer at Instil and AWS Community Builder. Enjoys talking about serverless, cars and coffee. Husband to Rebekah, father to Joy Tabitha, both of which think I copy paste for a living."
    },
    "matthias-gessenay": {
        "name": "Matthias Gessenay",
        "photo": "matthias-gessenay.jpg",
        "title": "Mastering the Azure Serverless Landscape",
        "description": "Serverless on the Azure Platform starts at no code and ends at large scale data processing notebooks or stateful functions. In this session, you will get the big picture of what is in the Azure platform and see by examples, when to use what. Also, we will unveil the top five architecture tips for building successful serverless apps on Azure. We will touch Logic Apps, Functions, Automation, Azure Notebooks, Containers, Machine Learning and more.",
        "about": "Matthias Gessenay is a Microsoft MVP and Trusted Advisor for the Microsoft Cloud Platform. He likes to contribute to the community and is a frequent conference speaker. He lives near Basel, Switzerland."
    },
    "pasini-stoll": {
        "name": "Alessandra Pasini & André Stoll",
        "photo": "pasini-stoll.gif",
        "title": "Let’s Bring Chaos into Serverless",
        "description": "The principles of chaos engineering have been battle-tested for years using traditional infrastructure and containerized microservices. But how do they work with Serverless functions and managed services? In this session, we'll cover the principles of chaos engineering, how to design and run chaos experiments, and specific weaknesses that you can test. Together we will dive deeper into how chaos engineering can be safely performed in Lambda functions using open-source libraries and different AWS tools. By attending this session, you'll gain a deeper understanding of how to improve the reliability and resilience of your Serverless application and be better equipped to handle unexpected failures and outages.",
        "about": "<b>Alessandra Pasini</b><br/>I'm Alessandra Pasini, a Solution Architect at Amazon Web Services (AWS) based in Zurich. My passion lies in the areas of Machine Learning and Serverless technologies, and I specialize in working with SMBs and Greenfield Enterprise customers throughout Switzerland. With my expertise, I've been able to help businesses design and implement cutting-edge solutions to achieve their goals and remain competitive. Outside of work, I enjoy keeping up with the latest tech advancements and sharing my knowledge with others.<br/><br/><b>André Stoll</b><br/>As a Solutions Architect at Amazon Web Services (AWS) I’m helping customers in Switzerland to leverage the full potential of the cloud. I have a background in Software Engineering, DevOps & SRE and currently focus on container, SaaS and serverless technologies. As a member of the Serverless community at AWS I advocate for event -driven architectures and serverless technologies in the wider community."
    },
    "alexey-loubyansky": {
        "name": "Alexey Loubyansky",
        "photo": "alexey-loubyansky.jpg",
        "title": "Amazon Lambdas with Quarkus",
        "description": "The talk will start with a brief introduction into the Quarkus approach of building applications to highlight how it is different from other development frameworks, then explain how support for Amazon Lambdas is implemented in Quarkus and demo some of the development features and practices it enables.",
        "about": "Alexey is a Principal Software Engineer at Red Hat, a member of Quarkus development team since 2018. Before joining the Quarkus team, he worked on the JBoss/WildFly AS for 15 years contributing to a number of its subsystems including EJB, JCA, Microcontainer, Management architecture and tools, patching and provisioning mechanisms."
    },
    "andreea-merariu": {
        "name": "Andreea Merariu",
        "photo": "andreea-merariu.jpg",
        "title": "Automating API Consumer Onboarding Process on AWS",
        "description": "When a business grows, the number of clients consuming its public APIs will also increase. These clients might be internal, such as other departments, or external, such as partners. While this is great for the business, it comes with challenges. When you onboard a new API consumer, you need to spend time generating client credentials, configuring API quota, and securely handing them over to the respective consumer. In this talk, using a real-life use case, I will dive into the intricacies of building a serverless application to automate creating credentials and securely delivering them. I will talk about the challenges I encountered and how leveraging a wide variety of AWS services can be invaluable in building a robust system for this purpose. I will leave you with my learnings and the process I underwent while architecting the solution.",
        "about": "Andreea is a Software Engineer at The Lego Group with a few years of experience in the industry. She has a passion for backend technologies but even more so for all things serverless. At the LEGO Group, she is designing and developing serverless applications on AWS. She is keen to engage with the community and constantly seeks new learning opportunities. Andreea is eager to share her journey into serverless and the interesting technical challenges she encounters along the way."
    },
    "jan-mayer": {
        "name": "Jan Mayer",
        "photo": "jan-mayer.jpg",
        "title": "Cloudless Testing of Serverless Applications",
        "description": "Testing serverless applications can be complex, and testing in the cloud can add additional costs and complexities. In this talk, we will explore an approach to testing Azure Functions applications using Behavior Driven Design (BDD) without relying on cloud resources.<br/>We will discuss the benefits of cloudless testing, demonstrate how to set up a local development environment for testing Azure Functions applications using BDD, and cover best practices for integrating cloudless testing into CI/CD pipelines.<br/>Attendees will learn how to test serverless applications effectively using BDD and gain an understanding of the tools and techniques needed to get started. We will also discuss the limitations of this approach and when testing in the cloud may still be necessary.<br/>By the end of this talk, attendees will have a better understanding of how to approach testing for serverless applications and the benefits of using BDD for cloudless testing.",
        "about": "Jan is a software developer with experience in scientific computing. During his PhD, he observed the complexities of scientific software development and sought to simplify the process. He currently works as a consultant at Valtech Mobility, where he provides data engineering services and develops software solutions for the automotive industry.<br/>Jan has presented at several conferences and workshops, sharing his insights on software development and scientific computing. He is dedicated to improving software development practices and helping others in the field."
    }
}